[New IDS alerts on internal IP]
alert.digest_mode = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Alert when signature fires on one internal IP address during the last 5 mins but did not fire during the last hour
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.custom.type = timeline_app.timeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = `stamus_index` event_type=alert sourcetype="suricata:alert" earliest=-1h | eval internal_ip=if(like(src_ip, "10.%") OR like(src_ip, "192.168.%"), src_ip, dest_ip) | eval ext_ip=if(like(src_ip, "10.%") OR like(src_ip, "192.168.%"), dest_ip, src_ip) | eval internal_port=if(like(src_ip, "10.%"), src_port, dest_port) | eval ext_port=if(like(src_ip, "10.%"), dest_port, src_port) | stats earliest(timestamp) as first, values(ext_ip) as other_ip, values(internal_port) as internal_port, values(ext_port) as other_port by alert.category, alert.signature, alert.signature_id, internal_ip | eval difftime=now()-strptime(first,"%Y-%m-%dT%H:%M:%S.%N%z") | eval alert_needed=if(difftime<60,"true", "false") | search alert_needed=true | table alert.signature alert.signature_id internal_ip internal_port other_ip other_port first

[Domain Controllers List]
action.email.useNSSubject = 1
alert.track = 0
description = List of domain controllers in the network using Stamus Networks data
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.custom.type = force_directed_viz.force_directed
display.visualizations.show = 0
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = | snhostsearch filter="services.values.app_proto=smb services.values.app_proto=krb5 services.port=389" | spath net_info{0}.agg output=Network | spath hostname{}.host output=Host | spath | table ip Host Network first_seen

[HTTP Servers]
action.email.useNSSubject = 1
alert.track = 0
description = Stamus Networks data on HTTP servers including Version, Port and Network information
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.custom.type = force_directed_viz.force_directed
display.visualizations.show = 0
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = | snhostsearch filter="services.values.app_proto=http net_info.agg!=internet" | spath path=services{} output=service_info | mvexpand service_info | spath ip | spath input=service_info path=values{} output=service_details | mvexpand service_details | spath input=service_details | search app_proto=http | spath input=service_info port | spath net_info{0}.agg output=Net| eval Network=if(isnull(Net), "Unknown", Net) | table ip Network port http.server

[TLS servers not running on port 443]
action.email.useNSSubject = 1
alert.track = 0
description = Stamus Networks data on TLS servers not running on port 443.
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.custom.type = force_directed_viz.force_directed
display.visualizations.show = 0
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = | snservicesearch filter="services.values.app_proto=tls services.port!=443" | spath | search service.app_proto=tls service.port!=443 | spath net_info{0}.agg output=Network | table ip Network service.port service.tls.fingerprint service.tls.issuerdn service.tls.subject

[Threats by Network]
action.email.useNSSubject = 1
alert.track = 0
description = Stamus Networks data on Threat seen by Network.
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.show = 0
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = `stamus_index` event_type="stamus" sourcetype="suricata:stamus" | eval Network = if('stamus.asset_net_info' == "", "Unknown", 'stamus.asset_net_info') | stats dc(stamus.asset) as Assets by Network, stamus.threat_name

[HTTP Servers not running on port 80]
action.email.useNSSubject = 1
alert.track = 0
description = Stamus Networks data on HTTP servers not running on standard port.
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.custom.type = timeline_app.timeline
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = | snservicesearch filter="services.values.app_proto=http services.port!=80" | spath | search service.port!=80 service.app_proto="http" | table ip service.port service.http.server

[Assets under Attack]
action.email.useNSSubject = 1
alert.track = 0
description = Report is using Stamus Network data.
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.show = 0
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = `stamus_index` event_type="stamus" sourcetype="suricata:stamus" | stats min(timestamp) as start_seen, max(timestamp) as last_seen by stamus.threat_name, stamus.asset, stamus.asset_net_info

[Recent services by Stamus Networks]
action.email.useNSSubject = 1
alert.track = 0
description = Stamus Networks data on services discovered during picked time range.
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.custom.type = force_directed_viz.force_directed
display.visualizations.show = 0
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = | snhostsearch filter="net_info.agg!=internet" | spath first_seen | rename first_seen as "Host First Seen" | spath services_count | search services_count >= 1 | spath path=services{} output=service_info | mvexpand service_info | spath ip | spath input=service_info path=values{} output=service_details | mvexpand service_details | spath input=service_details | eval start_seen=strptime(first_seen, "%Y-%m-%dT%H:%M:%S.%6N%z") | addinfo | eval diff_start=(tonumber(start_seen) - info_min_time) | search diff_start > 0 | eval diff_end=(info_max_time - tonumber(start_seen)) | search diff_end > 0|  spath input=service_info port | spath net_info{0}.agg output=Net| eval Network=if(isnull(Net), "Unknown", Net) | rename first_seen as "Service First Seen" | eval Information=coalesce('http.server', 'tls.cn', 'ssh.server.software_version', "No detail") | table ip port app_proto Information "Service First Seen" Network "Host First Seen"

[New Services on Known Hosts by Stamus Networks]
action.email.useNSSubject = 1
alert.track = 0
description = Stamus Networks data on services discovered during picked time range on already known hosts.
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","source","hostname"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.custom.type = force_directed_viz.force_directed
display.visualizations.show = 0
request.ui_dispatch_app = stamus
request.ui_dispatch_view = search
search = | snhostsearch filter="net_info.agg!=internet" | addinfo | spath first_seen  | eval host_first_seen=strptime(first_seen, "%Y-%m-%dT%H:%M:%S.%6N%z") | eval diff_host_start=(tonumber(host_first_seen) - info_min_time) | search diff_host_start < 0 | rename first_seen as "Host First Seen" | spath services_count | search services_count > 1 | spath path=services{} output=service_info | mvexpand service_info | spath ip | spath input=service_info path=values{} output=service_details | mvexpand service_details | spath input=service_details | eval start_seen=strptime(first_seen, "%Y-%m-%dT%H:%M:%S.%6N%z") | eval diff_start=(tonumber(start_seen) - info_min_time) | search diff_start > 0 | eval diff_end=(info_max_time - tonumber(start_seen)) | search diff_end > 0|  spath input=service_info port | spath net_info{0}.agg output=Net| eval Network=if(isnull(Net), "Unknown", Net) | rename first_seen as "Service First Seen" | eval Information=coalesce('http.server', 'tls.cn', 'ssh.server.software_version', "No detail")  | table ip port app_proto Information "Service First Seen" Network "Host First Seen"

[Spike in Unique Alerts]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = stamus_for_splunk
request.ui_dispatch_view = search
search = `stamus_index` event_type="alert" sourcetype="suricata:alert" | spath alert |\
eval ip=mvappend(src_ip, dest_ip) |\
lookup ip_alert_seen.csv ip, alert.signature_id |\
eval alert_first_seen=if(isnull(first_seen), relative_time(now(), "+1d@d"), strptime(first_seen, "%Y-%m-%dT%H:%M:%S.%6N%z")) |\
addinfo |\
eval diff_alert_start=(tonumber(alert_first_seen) - info_min_time) |\
search diff_alert_start > 0 |\
stats distinct_count(alert.signature_id) as uniq_alerts, min(timestamp) as alerts_first_seen, max(timestamp) as alerts_last_seen by ip | \
search uniq_alerts >= 4 |\
eval alert_start= strptime(alerts_first_seen, "%Y-%m-%dT%H:%M:%S.%6N%z") |\
eval alert_end= strptime(alerts_last_seen, "%Y-%m-%dT%H:%M:%S.%6N%z") |\
eval duration=tostring(round(alert_end - alert_start, 0), "duration") |\
table ip, uniq_alerts, alerts_first_seen, alerts_last_seen, duration

[Update Alerts Statistics]
action.lookup = 1
action.lookup.filename = ip_alert_seen.csv
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 0 0 * * *
description = Update a lookup used in other queries.
dispatch.earliest_time = -1d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = stamus_for_splunk
request.ui_dispatch_view = search
search = `stamus_index` event_type="alert" sourcetype="suricata:alert" earliest=-2w | spath alert | eval ip=mvappend(src_ip, dest_ip) | stats count, min(timestamp) as first_seen by ip, alert.signature_id | outputlookup ip_alert_seen.csv

[TLS Cipher Suites]
action.email.useNSSubject = 1
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = stamus_for_splunk
request.ui_dispatch_view = search
search = event_type=tls | spath tls.ja3s.string output=ja3s_string | eval ja3s_elt=split(ja3s_string,",") | eval cipher_id=mvindex(ja3s_elt, 1) | lookup tls_cipher_mapping.csv id as cipher_id | rename cipher as "TLS Cipher Suite" | top "TLS Cipher Suite"
